{
    "KE2 Temp Plus Valve Control Quick Start Guide en": {
        "1. Hardware features and specifications": "B (1)10’ pressure transducer C (1) temperature sensor – 45” D (1) temperature sensor – 10’ C D F (1) sensor zip tie H (2) screws for high voltage shield (4) High voltage wires matched to the load of the 18 gauge twisted shielded pair (if extending sensor alternates between dEF and the actual temperature measured by the air sensor. lower conduit connection. The temperature sensor, pressure trans- C Next remove the high voltage protective cover. There are two screws D With the high voltage cover removed, the two screw terminal con- D power supply. E F The liquid line solenoid-compressor contactor relay accepts a vari- ety of input voltages and is not required to match the controller’s input. See table for relay ratings. The relay uses the 3-position screw When connecting the wires to the relay, the controller will be break- If solenoid will use the same voltage as controller, one leg of incom- nected to the common terminal of the liquid line solenoid relay, the Relay Rating (1) Relay G Replace high voltage shield after wiring is completed. Double Throw Resistive 5A 5A 5A 5A Low Voltage Connections H Air Temperature Sensor - The air temperature sensor terminal is lo- temperature sensor input consists of the right two terminal positions. The sensor is not polarized and may be connected in either orienta- The sensor should be fed through the top conduit connection, before I Suction Temperature Sensor - The suction temperature sensor attached. The temperature sensor input consists of the middle two terminal positions. The sensor is not polarized and may be connected The suction temperature sensor is required when applying the con- troller with an electronic expansion valve. The sensor’s proximity control from an electronically controlled valve, the sensor must be entation of the sensor remains at the 4 or 8 o’clock position. The sen- designed or low ambient operation. Only zip tie the sensor bulb, DO NOT zip tie the sensor cable. Pressure Transducer – The pressure transducer terminal is located sure transducer input consists of the 3 terminal positions on the left- can be repurposed for the pressure transducer. Cut and braze a 1/4” pressure transducer can alternatively be attached to the suction ser- Internet access (wired or Wi-Fi) KE2 Wireless Sensors From the Webpage you can monitor temperatures, relay status and Green light - Calling for refrigeration, liquid Line Solenoid (LLS)/compressor contactor relay energized. Green blinking - Waiting on short cycle timer to energize/de-energize LLS/comp. contactor relay. display. The display alternates between dEF and the actual temperature measured by the air sensor. This continues until the temperature has reached COr COr Compressor Relay OFF - On OFF On iSA iSA Inlet Sensor Alarm: Valve closes and turns system off. Red PSA PSA Pressure Sensor Alarm: Valve closes and turns system off. Red SSA SSA Suction Temperature Sensor Alarm: Valve closes and turns system off. Red Room (Air )Sensor Alarm: Alarm occurs when the room temperature sensor input is open or Leaving Liquid Temp Sensor Alarm: Leaving Liquid Temp Sensor (Temp 2) input is open or LSA LSA Amber rEL reL Manually Control Relay rEL reL Manually Control Relay rEL reL Manually Control Relay rEL reL Manually Control Relay ASA ASA Room/Air Sensor Alarm Alarm Alarm occurs when the room temperature sensor input is open or shorted COr COr Compressor Relay Variables Current state of liquid line solenoid/compressor relay iSA iSA Inlet Sensor Alarm Alarm Valve closes and turns system off. LPC LPC Low Pressure Cut Out Setpoint Pressure at which controller de-energizes the Compressor/Liquid Line Solenoid relay (COr) LPd LPd Low Pressure Cut Out Differential Setpoint Psi above Low Pressure Cutout (LPC) at which Compressor/Liquid Line Solenoid relay (COr) is energized LSA LSA Leaving Liquid Temp Sensor Alarm Alarm Leaving Liquid Temp Sensor (Temp 2) input is open or shorted. SUb (subcool) control mode only. OFF OFF Compressor Relay OFF Variable Status of Compressor Relay - OFF On On Compressor Relay On Variable Status of Compressor Relay - On PSA PSA Pressure Sensor Alarm Alarm Suction pressure sensor is shorted, open or pressure out of range. rEL rEL Relay Control Manual Manually control the relay (pressure/temp) is selected as InP (input type), (requires pressure transducer and T1 sensor) SSA SSA Suction Temperature Sensor Alarm Valve closes and turns system off. Pressure Transducer Pressure Transducer Air Temp Sensor Suction Sensor Pressure Transducer LLS/Comp. Contactor Relay Wiring Relay POWER SUPPLY ②The controller relay will switch with 3rd party signal. The relay will be energized while the system is running. Pressure Transducer Pressure Transducer Pressure Transducer Pressure Transducer Pressure Transducer CONTROLLER POWER SUPPLY Pressure Transducer CONTROLLER POWER SUPPLY * Shorting the suction temperature sensor input will cause the controller to go to System Off mode (SOF) and close the LLS and EEV. Air Temp Sensor / Suction Sensor Suction Pressure Transducer of Ribbon Cable. Dimensions - Inches Air Temp Sensor Suction Sensor 1.09 Pressure Transducer from L1 (terminal 1) Relay CN2 POWER SUPPLY POWER SUPPLY Relay LLS Power Supply LLS",
        "2. Functions": "the installed KE2 Temp+Valve controller. KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual The following are included in the KE2 Temp + Valve kit, pn 21301: A (1) KE2 Temp+ Valve controller (pn21393 - controller only) controller. A list is provided below Conduit to go between the controller and the H liquid line solenoid/compressor and the controller. The KE2 Temp + Valve is designed for a wide range of applications, with many Walk-in Under Counter Outside controlled space Remote Monitoring, Control, Alarm Notifications The Temp + Valve includes RS-485 Modbus communications, and can now Service Call Saver - Post Defrost Indicator To eliminate unnecessary service calls, the KE2 Temp + Valve alerts the user when it is coming out of a defrost cycle using the onboard display. The display This continues until the temperature has reached setpoint, or for the amount of time set by dFt (Defrost Time) whichever is shorter. KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual Wiring the Controller The Temp + Valve was designed with functionality in mind. The con- troller accepts 120V / 208-240V to power the controller through the ducer, valve, and communication wires are attached via the upper A When wiring the controller first remove the display by loosening nectors can be seen. The Red 2-position connector is the controller’s terminal to make the connection on the board. It may control either the liquid line solenoid or as a pilot to the compressor contactor. KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual control modes. See the diagrams at the end of the bulletin for more to the evaporator outlet differs slightly for electronically controlled valves from the placement of a TEV bulb. Due to the more refined control modes. See the diagrams at the end of the bulletin for more When replacing a mechanical expansion valve, the external equalizer male SAE fitting with schrader valve to the external equalizer. The tube, approx. 3 inches downstream of the suction temperature sen- Remote Monitoring, Control, Alarm Notifications The KE2 Temp + Valve includes RS-485 Modbus communications, and KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual Accessing the KE2 Temp + Valve on a Local Area Network When the KE2 Temp + Valve is connected to the KE2-EM communication device’s serial terminal, the device will find the controller, and provide Accessing the KE2 Temp + Valve on the Valve can be accessed remotely through the KE2 email/text alarm alerts feature, for instant noti- - 3. 1 - 3. 1 fication of system issues. More information on Hold for manual defrost Hold for manual defrost KE2 Therm Modbus Controllers: A.1.76. KE2 Temp + Air Defrost KE2 Temp + Valve Control TMonrcaytor KE2 Adaptive Control KE2 Therm Ethernet Controllers: KE2 Controlled Environment KE2 Compressor Sequencer OEM KE2 Condensor Fan Control alarms, as well as make changes to setpoints, and manually control KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual Programming the Controller KE2 Temp + Valve Control Basic Navigation Many applications can use the controller’s preset defrosts per day. This Understanding the KE2 Temp + Valve Defrost’s menu structure will simpli- automatically spaces the defrosts throughout the day, based on the num- ber of defrost cycles selected. The user can change the number of defrost cycles performed by changing the Defrost per Day setpoint, ranging from 0 to 12. Or, if required, each individual defrost can be scheduled for a spe- NOTE: A brief description of each of the abbreviations is found in the al- Red light - Critical alarm (system is NOT running) Yellow light - Non-critical alarm (system running) until CtL (control type) displays on the screen. (control type) (control type) EEV Control Only EEV Control Only EEV Control No Thermostat HGB & EEPR Control Subcool Control EEV Control No Thermostat HGB & EEPR Control dFt Menu FAC⑦ ② Only shown if SUb control is selected. LAO POS⑨ ③Only shown if SH, SHt, or SUb control is selected. SOF⑦⑧ ⑨ Press ENTER to enter manual valve control, KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual Service Call Saver - Post Defrost Indicator To eliminate unnecessary/unwarranted service calls, the KE2 Temp + Valve alerts the user when it is coming out of a defrost cycle using the onboard setpoint, or for the amount of time set by dFt (Defrost Time) whichever is shorter. rtP rtP Room Temperature (not shown if in SUb, EEPR or EHGBP control, and input is pressure) -50ºF to 100ºF LLt LLt Leaving Liquid Temp (Subcool control only) -50ºF to 150ºF SYS SYS System Mode: Refrigerate, Defrost, Off, System Off (manually) rEF, dEF, OFF, SOF, ESO SH SH Superheat (only shown if SH or SHt control selected) 0ºF to 200ºF PrS Prs Pressure (only if input control type is pressure) -14.6 to 150 psig SUt SUt Suction Temperature (only if in SH or SHt control selected) -50ºF to 150ºF SAt SAT Saturation Temperature (only if in SH or SHt control selected, and Pt is selected as input) -87ºF to 150ºF inL inL Inlet Temperature (only if in SH or SHt control selected, and tt selected as input) -50ºF to 150ºF OPn OPn Valve Percent Open 0 to 100% nOA nOA (no alarm), PSA, SSA, iSA, ASA, HSH, ALS ALS Alarm Status: See table below for alarm descriptions. Alarm List Refrigerant List Alarms Description LED Refrigerant Abbreviation High Pressure Alarm: occurs when the temperature reading is above the Pressure set point HPA HPA + High Alarm Offset setpoint for the amount of time in setpoint High/Low Alarm Delay.; High Amber Temperature or pressure alarm is suppressed while in defrost. High Superheat Alarm: Occurs when superheat is 2 or more degrees above setpoint and valve High Temperature Alarm: occurs when the temperature reading is above the Temperature set point + Temperature differential set point + High Alarm Offset set point for the amount of time HtA HtA Amber in setpoint High/Low Alarm Delay; High Temperature or pressure alarm is cleared and disabled while in defrost Low Pressure Alarm: When LPC (Low Pressure Cut Out) is enabled while in refrigeration mode, LPA LPA if compressor is shut off 3 times for pressure going below LPC set point without being satisfied Amber on temperature, set alarm; Alarm is cleared when temperature is satisfied Low Superheat Alarm: Occurs when superheat is less than 3 degrees for 5 minutes; Clears shorted. SUb (subcool) control mode only. Low Temperature Alarm: occurs when the temperature reading is below the Temperature LtA LtA setpoint - Low Alarm Offset setpoint for the amount of time in setpoint High & Low Temperature Amber Alarm Delay; Low temperature or pressure is cleared and disabled when in defrost Pump Down Timeout Alarm: Occurs when call for pumping system down and the compressor Alarm is cleared when pressure reaches LPC setpoint instead of timing out. Power Failure: occurs when the controller has lost power at some point, and controller had CUS (custom defrost schedule) selected under Defrosts Per Day Short Cycle Compressor Alarm: Occurs when the compressor has to come back on because of while in Off mode, can be over multiple cycles, set alarm; Clear alarm if pressure does not go KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual CtL CtL Control Type - EEV+Temp, EEV Only, EEPR, EHGBP, Subcool SHt Edt Edt Valve Type: Mechanical (tHr), KE2-HSV (HS), KE2-RSV (rS), tHr, HS, rS, SEi ,SEr CrL, CUS** (valve type) Ub Ub Motor Type Uni-(unipolar), bi (bipolar) Uni bi Unipolar tS tS Temperature Setpoint -50°F (-45°C) to 100°F (38°C) 35.0°F (9.7°C) CSH CSH Compressor Starts/Hour Maximum 5 (Off)* to 10 6 dPd dPd Defrost Per Day 0 to 12, CUS** 4 d1 d1 Start time of Defrost #1 00 - 23 diS (disabled) d2 d2 Start time of Defrost #2 00 - 23 diS d3 d3 Start time of Defrost #3 00 - 23 diS d4 d4 Start time of Defrost #4 00 - 23 diS d5 d5 Start time of Defrost #5 00 - 23 diS Only if dPd (Defrosts d6 d6 Start time of Defrost #6 00 - 23 diS d7 d7 Start time of Defrost #7 00 - 23 diS d8 d8 Start time of Defrost #8 00 - 23 diS d9 d9 Start time of Defrost #9 00 - 23 diS d10 d10 Start time of Defrost #10 00 - 23 diS d11 d11 Start time of Defrost #11 00 - 23 diS d12 d12 Start time of Defrost #12 00 - 23 diS dFt dft Defrost Time 6 min to 720 min 45 min *Selecting fewer than 5 compressor starts per hour results in the starts per hour feature being turned off. The compressor will then function on temperature only. KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual CtL CtL Control Type - EEV+Temp, EEV Only, EEPR, EHGBP, Subcool SHt Edt Edt Valve Type: Mechanical (tHr), KE2-HSV (HS), KE2-RSV (rS), tHr, HS, rS, SEi ,SEr CrL, CUS** (valve type) Ub Ub Motor Type Uni-(unipolar), bi (bipolar) Uni bi Unipolar ture/temperature (tt) tS tS Temperature Setpoint -50°F (-45°C) to 100°F (38°C) 35.0°F (4.4K) CSH CSH Compressor Starts/Hour Maximum 5 (Off)* to 10 6 dPd dPd Defrost Per Day 0 to 12, CUS** 4 d1 d1 Start time of Defrost #1 00 - 23 diS (disabled) d2 d2 Start time of Defrost #2 00 - 23 diS d3 d3 Start time of Defrost #3 00 - 23 diS d4 d4 Start time of Defrost #4 00 - 23 diS d5 d5 Start time of Defrost #5 00 - 23 diS Only if dPd (Defrosts d6 d6 Start time of Defrost #6 00 - 23 diS d7 d7 Start time of Defrost #7 00 - 23 diS d8 d8 Start time of Defrost #8 00 - 23 diS d9 d9 Start time of Defrost #9 00 - 23 diS d10 d10 Start time of Defrost #10 00 - 23 diS d11 d11 Start time of Defrost #11 00 - 23 diS d12 d12 Start time of Defrost #12 00 - 23 diS dFt dft Defrost Time 6 min to 720 min. 45 min. HAO HAO High Alarm Offset 1°F (1K) to 10°F (6K) 5.0°F LAO LAO Low Alarm Offset 1°F (1K) to 10°F (6K) 3.0°F tAd tAd Temp Alarm Delay 1 min. to 180 min 90 min. Unt Unt Units for temperature display FAH or CEL FAH CLA CLA Manually Clear Alarms FAC FAC Return Controller to Factory Default Settings MANUAL CONTROL POS POS Manually Adjust Valve Position 0 to 100% *Selecting fewer than 5 compressor starts per hour results in the starts per hour feature being turned off. The compressor will then function on temperature only. KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual Basic Menu: EEV Control Only - No Thermostat (SH) CtL CtL Control Type - EEV+Temp, EEV Only, EEPR, EHGBP, Subcool SH Edt Edt Valve Type: Mechanical (tHr), KE2-HSV (HS), KE2-RSV (rS), (valve type) Ub Ub Motor Type Uni-(unipolar), bi (bipolar) Uni bi Unipolar * Selecting fewer than 5 compressor starts per hour results in the starts per hour feature being turned off. The compressor will then function on temperature only. KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual Advanced Menu: EEV Control Only - No Thermostat (SH) Control Type - EEV+Temp, EEV Only, EEPR, EHGBP, SHt, EPr, HGb, SH, SUb Edt Edt Valve Type: Mechanical (tHr), KE2-HSV (HS), KE2- (valve type) Ub Ub Motor Type Uni (unipolar), bi (bipolar) Uni bi Unipolar temperature/temperature (tt) tAd tAd Temp Alarm Delay 1 min to 180 min 90 min Unt Unt Units for temperature display FAH or CEL FAH CLA CLA Manually Clear Alarms FAC FAC Return Controller to Factory Default Settings MANUAL CONTROL POS POS Manually Adjust Valve Position 0 to 100% * Selecting fewer than 5 compressor starts per hour results in the starts per hour feature being turned off. The compressor will then function on temperature only. KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual Control Type - EEV+Temp, EEV Only, EEPR, SHt, EPr, HGb, SH, SUb Hot Gas Bypass Valve Regulating Valve ESR20 (ES2), KVS15 (dS1), KVS42 (dS4) , Custom Cd2 Cd9 ES1 ES2 dS1 Cd9 (valve type) Ub Ub Motor Type Uni-(unipolar), bi (bipolar) Uni bi Unipolar tS TS Temperature Setpoint -50.0°F (-45°C) to 100°F (38°C) 35.0°F (9.7°C) CSH CsH Compressor Starts/Hour Maximum 5 (Off)* to 10 6 dPd dpd Defrost Per Day 0 to 12, CUS** 4 d1 d1 Start time of Defrost #1 00 - 23 diS (disabled) d2 d2 Start time of Defrost #2 00 - 23 diS d3 d3 Start time of Defrost #3 00 - 23 diS d4 d4 Start time of Defrost #4 00 - 23 diS d5 d5 Start time of Defrost #5 00 - 23 diS Only if dPd (Defrosts d6 d6 Start time of Defrost #6 00 - 23 diS d7 d7 Start time of Defrost #7 00 - 23 diS d8 d8 Start time of Defrost #8 00 - 23 diS d9 d9 Start time of Defrost #9 00 - 23 diS d10 d10 Start time of Defrost #10 00 - 23 diS d11 d11 Start time of Defrost #11 00 - 23 diS d12 d12 Start time of Defrost #12 00 - 23 diS dFt dft Defrost Time 6 min to 720 min 45 min * Selecting fewer than 5 compressor starts per hour results in the starts per hour feature being turned off. The compressor will then function on temperature only. KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual Control Type - EEV+Temp, EEV Only, EEPR, SHt, EPr, HGb, SH, SUb Hot Gas Bypass Valve Regulating Valve ESR20 (ES2), KVS15 (dS1), KVS42 (dS4) , Custom Cd2 Cd9 ES1 ES2 dS1 Cd9 (valve type) Ub Ub Motor Type Uni-(unipolar), bi (bipolar) Uni bi Unipolar temperature (tPr) tS TS Temperature Setpoint -50.0°F (-45°C) to 100°F (38°C) 35.0°F (9.7°C) CSH CsH Compressor Starts/Hour Maximum 5 (Off)* to 10 6 dPd dpd Defrost Per Day 0 to 12, CUS** 4 d12 d12 Start time of Defrost #12 00 - 23 diS (disabled) d11 d11 Start time of Defrost #11 00 - 23 diS d10 d10 Start time of Defrost #10 00 - 23 diS d9 d9 Start time of Defrost #9 00 - 23 diS d8 d8 Start time of Defrost #8 00 - 23 diS Only if dPd (Defrosts d7 d7 Start time of Defrost #7 00 - 23 diS d6 d6 Start time of Defrost #6 00 - 23 diS d5 d5 Start time of Defrost #5 00 - 23 diS d4 d4 Start time of Defrost #4 00 - 23 diS d3 d3 Start time of Defrost #3 00 - 23 diS d2 d2 Start time of Defrost #2 00 - 23 diS d1 d1 Start time of Defrost #1 00 - 23 diS dFt dft Defrost Time 6 min to 720 min 45 min HAO HAO High Alarm Offset 1.0°F (1K) to 10.0°F (1K) 5.0°F LAO LAO Low Alarm Offset 1.0°F (1K) to 10.0°F (1K) 3.0°F tAd tAd High & Low Temp or Pressure Alarm Delay 1 min to 180 min 90 min Unt Unt Units for temperature display FAH or CEL FAH CEL FAH CLA CLA Manually Clear Alarms FAC FAC Return Controller to Factory Default Settings MANUAL CONTROL POS POS Manually Adjust Valve Position 0 to 100% * Selecting fewer than 5 compressor starts per hour results in the starts per hour feature being turned off. The compressor will then function on temperature only. KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual Control Type - EEV+Temp, EEV Only, EEPR, EHGBP, SHt, EPr, HGb, SH, SUb Edt Edt Valve Type: Mechanical (tHr), KE2-HSV (HS), KE2- (valve type) Ub Ub Motor Type Uni-(unipolar), bi (bipolar) Uni bi Unipolar temperature/temperature (tt) tS tS Temperature Setpoint -50°F (-45°C) to 100°F (38°C) 35.0°F (4.4K) KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual Control Type - EEV+Temp, EEV Only, EEPR, EHGBP, SHt, EPr, HGb, SH, SUb Edt Edt Valve Type: Mechanical (tHr), KE2-HSV (HS), KE2- (valve type) Ub Ub Motor Type Uni-(unipolar), bi (bipolar) Uni bi Unipolar temperature/temperature (tt) tS tS Temperature Setpoint -50°F (-45°C) to 100°F (38°C) 35.0°F (4.4K) HAO HAO High Alarm Offset 1°F (1K) to 10°F (6K) 5.0°F LAO LAO Low Alarm Offset 1°F (1K) to 10°F (6K) 3.0°F tAd tAd Temp Alarm Delay 1 min to 180 min 90 min Unt Unt Units for temperature display FAH or CEL FAH CLA CLA Manually Clear Alarms FAC FAC Return Controller to Factory Default Settings MANUAL CONTROL POS POS Manually Adjust Valve Position 0 to 100% KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual Adr Adr Modbus Address Setpoint Controller’s address for communications ALS ALS Alarm Status Variable Pressing ENTER from ALS will show active alarm list; scroll through list using up or down arrow. bi bi Bipolar Setpoint Option under (Ub) Motor Type when using a CUS (custom) valve Cd2 CD2 CDS 2-7 Valve Setpoint Option under EDt valve selection for pressure regulating valves Cd9 CD9 CDS 9 Valve Setpoint Option under EDt valve selection for pressure regulating valves CEL CEL Celsius Setpoint Option for temperature units CLA CLA Clear Alarms Manually Manual Allows user to manually clear alarms CrL CrL Carel Valve Setpoint Option under EDt (Expansion Device Type) when SH (Superheat) is selected Select the type of control: SH (Electronic Expansion Valve), SHt (Electronic Expansion Valve with Thermostat) EPR CtL CtL Control Type Setpoint (Electronic Pressure Regulating Valve), HGB (Electronic Hot Gas Bypass Valve), CUS CUS Custom Setpoint Used for Custom defrost schedule or Custom valve option d1 d1 Defrost #1 Setpoint Start time of Defrost #1 when in defrosts per day (dPd) is custom (CUSt); based on 24-hour clock d2 d2 Defrost #2 Setpoint Start time of Defrost #2 when in defrosts per day (dPd) is custom (CUSt); based on 24-hour clock d3 d3 Defrost #3 Setpoint Start time of Defrost #3 when in defrosts per day (dPd) is custom (CUSt); based on 24-hour clock d4 d4 Defrost #4 Setpoint Start time of Defrost #4 when in defrosts per day (dPd) is custom (CUSt); based on 24-hour clock d5 d5 Defrost #5 Setpoint Start time of Defrost #5 when in defrosts per day (dPd) is custom (CUSt); based on 24-hour clock d6 d6 Defrost #6 Setpoint Start time of Defrost #6 when in defrosts per day (dPd) is custom (CUSt); based on 24-hour clock d7 d7 Defrost #7 Setpoint Start time of Defrost #7 when in defrosts per day (dPd) is custom (CUSt); based on 24-hour clock d8 d8 Defrost #8 Setpoint Start time of Defrost #8 when in defrosts per day (dPd) is custom (CUSt); based on 24-hour clock d9 d9 Defrost #9 Setpoint Start time of Defrost #9 when in defrosts per day (dPd) is custom (CUSt); based on 24-hour clock d10 d10 Defrost #10 Setpoint Start time of Defrost #10 when in defrosts per day (dPd) is custom (CUSt); based on 24-hour clock d11 d11 Defrost #11 Setpoint Start time of Defrost #11 when in defrosts per day (dPd) is custom (CUSt); based on 24-hour clock d12 d12 Defrost #12 Setpoint Start time of Defrost #12 when in defrosts per day (dPd) is custom (CUSt); based on 24-hour clock dFt dFt Defrost Time Setpoint Maximum time system is allowed in defrost diS diS Disabled Setpoint Choice under Start time when setting CUS (custom) dPd (defrosts per day) dPd dPd Defrost Per Day Setpoint Number of defrosts per day 0-12, CUS (custom) ds1 ds1 Danfoss KVS 15 Valve Setpoint Option under EDt (valve selection) for pressure regulating valves ds4 ds4 Danfoss KVS 42 Valve Setpoint Option under EDt (valve selection) for pressure regulating valves Edt Edt Expansion Device Type Setpoint Valve Selection EPr EPr Electronic Pressure Regulating Setpoint Type of control option under CtL (control type) ES1 ES1 ESR 12 Valve Setpoint Option under EDt valve selection for pressure regulating valves ES2 ES2 ESR 20 Valve Setpoint Option under EDt valve selection for pressure regulating valves ESO ESO External System Off Setpoint When 3rd party signal present valve closes FAH FAH Fahrenheit Setpoint Default for all temperatures displayed FAC FAC Factory Default Manual Manual option to return controller to Factory Default settings HAO HAO High Alarm Offset Setpoint Number of degrees above the Temperature Setpoint (tS) for a High Temp Alarm (HtA) condition. HGb H B Hot Gas Bypass Valve Setpoint Option under CtL (Control Type) Occurs when the temperature reading is above the Pressure setpoint + High Alarm Offset setpoint for the HPA HPA High Pressure Alarm Alarm amount of time in setpoint High Low Alarm Delay.; High Temperature or pressure alarm is cleared and disabled while in defrost. HS HS KE2-HSV Valve Setpoint Electronic expansion valve option under EDt (valve selection) Occurs when superheat is 2 or more degrees above set point and valve is 100% open for 90 minutes; Clears when HSH HSH High Superheat Alarm Alarm Occurs when the temperature reading is above the Temperature set point + Temperature differential set point HtA HtA High Temperature Alarm Alarm + High Alarm Offset set point for the amount of time in set point High & Low Alarm Delay; High Temperature or pressure alarm is cleared and disabled while in defrost inL inL Inlet Temperature Variable Temperature measured at the evaporator inlet. Only if SH and tt are selected as the input inP inP Input Type Setpoint Select type of control: EPR & HGb - PrS (pressure) or tPr (temp); EEV - Pt (pressure/temp)or tt (temp/temp) int int Integral Setpoint A coefficient to the valve control algorithm that increases valve responsiveness LAO LAO Low Alarm Offset Setpoint Number of degrees below the Temperature Setpoint (tS) for a Low Temp Alarm (LtA) condition. LPA LPA Low Pressure Alarm Alarm Pressure is below Low Pressure Cutout (LPC) after 3 consecutive attempts to start the system KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual LPt LPt Low Pressure Cut Out Delay Setpoint Time delay before Low Pressure Alarm (LPA) is activated. 0 = Disabled. Occurs when superheat is 2 or more degrees above set point and valve is 100% open for 90 minutes,; Clears LSH LSH Low Superheat Alarm Alarm LLt LLt Leaving Liquid Temp Variable Temperature of the liquid leaving the heat exchanger Average temperature is below the Temperature Setpoint (tS) - Low Alarm Offset (LAO) for the amount of time in LtA LtA Low Temperature Alarm Alarm the High & Low Alarm Delay (tAd) nOA nOA No Alarm Variable Indicates system is clear of alarm conditions OPn OPn Valve Percent Open Variables The percentage the valve is open from 0 to 100% Occurs when call for pumping system down and the compressor is turned off due to time out instead of pressure Pdt Pdt Pump down Timeout Alarm Alarm reaching LPC setpoint for 2 consecutive times; Alarm is cleared when pressure reaches LPC setpoint instead of Occurs when the controller has lost power at some point, and controller had CUS (custom defrost schedule) PF PF Power Failure Alarm selected, under Defrosts Per Day (dPd) POS POS Manually Adjust Valve Position Manual Manually open or close the electronic valve in percentage increments (1%, 10%, or 100% increments) PrO PrO Proportional Setpoint A coefficient to the valve control algorithm that increases valve responsiveness PrS PrS Pressure Setpoint Option for InP (input type) when HGB or EPR are selected for CtL (control type) PSP PSP Pressure Setpoint Setpoint Available when HGB or EEPR control is selected. Target pressure for control algorithm. Pt Pt Pressure/Temperature Setpoint Option for InP (input type) when SH (EEV) is selected for CtL (control type) rS rS KE2-RSV Setpoint Electronic Expansion Valve Option under EDt (Expansion Device Type) rtP rtP Room Temp Variable Temperature of the refrigerated space; Not shown if in EEPR or EHGBP control and input is pressure. Saturation temperature as calculated by the controller,Displayed if SH is selected for CtL (control type), and Pt SAt SAt Saturation Temperature Variable Occurs when the compressor has to come back on because of pressure going above LPC setpoint without satis- SCC SCC Short Cycle Compressor Alarm fying minimum off time. If this occurs 4 times while in Off mode, can be over multiple cycles, set alarm; Clear alarm if pressure does not go above LPC setpoint through minimum off time. SD3 SD3 SDR-3 Valve Setpoint Electronic Hot Gas Bypass Valve under EDt (Expansion Device Type) SD4 SD4 SDR-4 Valve Setpoint Electronic Hot Gas Bypass Valve under EDt (Expansion Device Type) SFS SFS Steps Full Stroke Setpoint When CUS (custom) valve is selected, the number of steps to fully open or close the valve SH SH Superheat Control Setpoint Control type under CtL when EEV Only is used. SH SH Superheat Variable Displayed if SHt is selected for CtL (Control Type) SHt SHt Superheat + Temperature Control Setpoint Control type under CtL when EEV+ Temperature is used. When CUS (custom) valve is selected, the steps per second in opening or closing the valve (provided by the valve The superheat value that the controller will maintain, not applicable if Edt (Expansion Device Type) = tHR SUb SUB Subcool Setpoint Control type under CtL when used for a subcooler application. SUt SUt Suction Temperature Variable Only if in SH (EEV) control SYS SYS System Mode Variable Displays mode of system operation: rEF (refrigerate), dEF (defrost), OFF, SOF (system manually shut off) tAd tAd Temperature Alarm Delay Setpoint High / Low Temperature Alarm Delay Amount of time to delay a high temp or low temp alarm tHr tHr Mechanical Valve Setpoint Mechanical Valve selection under EDt (Expansion Device Type) tOd tOd Time of Day Setpoint Used to set the time of day on the controller; Only displayed when dPd (defrosts per day) is CUS (custom) tS tS Temperature Setpoint Setpoint Room temperature to be maintained tt tt Temperature/Temperature Setpoint Option for InP (input type) when HS (EEV) is selected for CtL (control type) tPr tPr Temperature Setpoint Option for InP (input type) when HGB or EPR are selected for CtL (control type) Ub Ub Motor Type Setpoint When CUS (custom) valve is selected, the type of valve motor: Uni (unipolar), bi (bipolar) KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual Custom Defrost Setup Please note, the KE2 Temp + Valve Con- C U S backup. If the controller loses power, the defrost schedule may be offset by the Defrost 1 (d1). amount of time the controllers is without Press and hold the button for 3 d1 = custom defrost 1 diS = disabled To set the first defrost, press dpd = defrosts per day button. ts = temperature setpoint Indicator ligShTtEsP 4 Yellowd liagyh) ti s- ndoisnp-lcaryiteicda,l alarm (system running) d i s Green light - compressor on button until CtL (control type) displays on the screen defrost time. Press E N T E R U t s o e v t i h e e w the u c p u a rr r e ro n w t s a e n tt d in g. down arrow Note: Defrost times may only be set controller’s display KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual CONTROL TYPE: Superheat and Temperature w. Air Defrost Control Type Superheat & Input Pressure/Temperature Temperature Suction Temperature Temperature Using the KE2-EM allows quick & easy access to monitor & control the KE2 Temp + Valve, as well as receive alarm notifications via text or email. For more information see Bulletin B.5.10. COMP CONTACTOR CONTROLLER CONTROL TYPE: Superheat Only Control Type Superheat Input Pressure/Temperature Suction Temperature ①KE2 Temp + Valve should be supplied with signal from 3rd party to close valve when function not desired. Using the KE2-EM allows quick & easy access to monitor & control the KE2 Temp + Valve, as well as receive alarm notifications via text or email. For more information see Bulletin B.5.10. KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual CONTROL TYPE: Hot Gas Bypass: Temperature Control Control Type Hot Gas Bypass Input Temperature Open = Run External Air Temperature Bypass Valve * KE2 Temp + Valve should be supplied with signal from 3rd party to close valve when function not desired. Using the KE2-EM allows quick & easy access to monitor & control the KE2 Temp + Valve, as well as receive alarm notifications via text or email. For more information see Bulletin B.5.10. CONTROL TYPE: Hot Gas Bypass: Pressure for Capacity Control Control Type Hot Gas Bypass Input Pressure Bypass Valve *KE2 Temp + Valve should be supplied with signal from 3rd party to close valve when function not desired. Using the KE2-EM allows quick & easy access to monitor & control the KE2 Temp + Valve, as well as receive alarm notifications via text or email. For more information see Bulletin B.5.10. KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual CONTROL TYPE: Electronic Evaporator Pressure Regulator: Discharge or Return Air Temperature Control Type Evaporator Pressure Input Temperature Short = Off System Off* Air Temperature *KE2 Temp + Valve should be supplied with signal from 3rd party to close valve access to monitor & control the KE2 Temp + Valve, as well as receive alarm Temperature CONTROL TYPE: Electronic Evaporator Pressure Regulator: Pressure Control Control Type Evaporator Pressure Input Pressure *KE2 Temp + Valve should be supplied O Sh p o e r n t = = O Ru ff n E Sy x s te te rn m a O l ff* w w i h t e h n s i f g u n n a c l ti f o ro n m n o 3 t r d d e p s a ir r e t d y . to close valve access to monitor & control the KE2 Temp + Valve, as well as receive alarm KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual Master: Controller 1 - Superheat & Temperature (SHt) because it also controls temperature Control Type Superheat & Temperature Suction Temperature Air Temperature Temperature Slave: Controller 2 - Superheat (SH) Control Type Superheat COM Temperature Evaporator 2 Slave: Controller 3 - Superheat (SH) Control Type Superheat COM Temperature Evaporator 3 KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual Control Type: Subcool Control Type Subcool Suction Temperature* KE2 Temp+Valve Control For Temp. Air Defrost, & Electronic Valve Control Installation Manual Leaving Liquid Temp (Subcooling Control) COMPRESSOR CONTACTOR CONTROLLER VAC COMP CONTROLLER COMP CONTROLLER POWER",
        "3. Core features": "",
        "4. Additional features": "be accessed remotely using the KE2 Edge Manager (KE2-EM). See page 4 for can now be accessed remotely using the KE2 Edge Manager (KE2- ModBus communication can be connected to existing Building Management System (BMS) or to ModBus ModBus communication can be connected to existing Building Management System (BMS) or to ModBus communication can be connected to existing Building Management System (BMS) or to ModBus communication can be connected to existing Building Management System (BMS) or to ModBus communication can be con- ModBus communication can be con- ModBus ModBus 120 (208 - 240)/1/60",
        "5. User experience": "the four corner screws. The display is connected to the lower board fy configuration. Figure 1 shows the basic button functions, as well as a 3 5 1 Access Setpoint mode by pressing and holding the E N T E R button Accessing the Menus ADVANCED MENUS BASIC MENUS Menu FAC⑦ ⑧Press BACK button to return to normal operation. Variables Menu Basic Menu: “Out of Box” or if Superheat (SHt) Advanced Menu *** Last zero is truncated on the display. Advanced Menu: “Out of Box” or if Superheat (SHt) *** Last zero is truncated on the display. *** Last zero is truncated on the display. *** Last zero is truncated on the display. Basic Menu: Hot Gas Bypass (HGb) or EEPRV (EPr) Menu *** Last zero is truncated on the display. Advanced Menu: Hot Gas Bypass (HGb) or EEPRV (EPr) Menu *** Last zero is truncated on the display. Basic Menu: Subcool (SUb) *** Last zero is truncated on the display. Advanced Menu: Subcool (SUb) ***Last zero is truncated on the display. Press the up arrow to display power. seconds until the dPd is displayed. tod = time of day Red ligPhret s- sc rtihtiec al aluaprm a r(rsoyswte umn tisil N toOdT r(utinmnein ogf) diS (disabled) will be displayed. Note: The time is displayed in military time 2:00 am would be 2 Press and hold the button, tS is there are only 3 digits, the time will be set displayed on the LEDs to the nearest 10 minutes. See examples Once the correct time is displayed, press and hold the button until d1 is displayed. troller’s display. displayed. Press the button to save set- button for 3 seconds, until tOd is (room temp will be displayed). displayed",
        "6. Connectivity": "wires/adding communication). immediate local network communication. More information on the Laptop for service Video 062 Communication Made Easy with Adr Adr Address, Mod Bus Communications 1 to 247 1 Adr Adr Address, Mod Bus Communications 1 to 247 1 Adr Adr Address, Mod Bus Communications 1 to 247 1 Adr Adr Address, Mod Bus Communications 1 to 247 1 Communication KE2 Therm’s KE2-EM Communication device. CN2 RS-485 RSV- Blue Org Yel Red Blk Transformer Sh B A Empty Red Grn Wht Blk Communication KE2 Therm’s KE2-EM Communication device. Communication KE2 Therm’s KE2-EM Communication device. Communication KE2 Therm’s KE2-EM Communication device. Communication KE2-EM Communication device. Communication KE2-EM Communication device. RS-485 RSV- Blue Org Yel Red Blk Transformer RS-485 RSV- Blue Org Yel Red Blk TransformNereutral (L2)",
        "7. Standards compliance": "Standard truck stock items are required to install the ing lead from the solenoid should be connected to the NO (normally Normally Open Normally Closed Standard: 10 psig to 150 psig Standard: 10 psig to 150 psig Standard: 10 psig to 150 psig",
        "8. Notes": "Caution: The board may be damaged if excessive force is used"
    }
}